In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("horas_estudadas.csv")

In [3]:
df.head()

     Nome  Segunda  Terça  Quarta  Quinta  Sexta  Sabado  Domingo
0  Victor        2      3       1       3      0       0        3
1  Amanda        0      3       0       4      3       1        2
2    Luis        1      2       4       5      6       0        0
3   Júlia        1      1       2       0      0       1        2

In [ ]:
df.min(axis = 0)

Nome       Amanda
Segunda         0
Terça           1
Quarta          0
Quinta          0
Sexta           0
Sabado          0
Domingo         0
dtype: object

In [ ]:
df.min(axis = 1)

0    0
1    0
2    0
3    0
dtype: int64

In [ ]:
def soma(a, b):
  return a + b

In [ ]:
soma(2,1)

3

In [ ]:
def sub_max_min(df):
  return df.max() - df.min()

In [ ]:
df2 = df.drop("Nome", axis = 1)

In [ ]:
df2.head()

   Segunda  Terça  Quarta  Quinta  Sexta  Sabado  Domingo
0        2      3       1       3      0       0        3
1        0      3       0       4      3       1        2
2        1      2       4       5      6       0        0
3        1      1       2       0      0       1        2

In [ ]:
df2.apply(sub_max_min, axis=0)

Segunda    2
Terça      2
Quarta     4
Quinta     5
Sexta      6
Sabado     1
Domingo    3
dtype: int64

In [ ]:
df2.apply(sub_max_min, axis=1)

0    3
1    4
2    6
3    2
dtype: int64

In [ ]:
df2.apply(lambda x: x.max() - x.min(), axis=0)

Segunda    2
Terça      2
Quarta     4
Quinta     5
Sexta      6
Sabado     1
Domingo    3
dtype: int64

In [ ]:
df.head()

     Nome  Segunda  Terça  Quarta  Quinta  Sexta  Sabado  Domingo
0  Victor        2      3       1       3      0       0        3
1  Amanda        0      3       0       4      3       1        2
2    Luis        1      2       4       5      6       0        0
3   Júlia        1      1       2       0      0       1        2

In [ ]:
df.Nome.apply(lambda x: x[0])

0    V
1    A
2    L
3    J
Name: Nome, dtype: object

In [ ]:
# ANTES
df2.head()

   Segunda  Terça  Quarta  Quinta  Sexta  Sabado  Domingo
0        2      3       1       3      0       0        3
1        0      3       0       4      3       1        2
2        1      2       4       5      6       0        0
3        1      1       2       0      0       1        2

In [ ]:
# DEPOIS
# Percorrendo coluna por coluna e aplicando o calculo
df2.apply(lambda x: x**2, axis=1)

   Segunda  Terça  Quarta  Quinta  Sexta  Sabado  Domingo
0        4      9       1       9      0       0        9
1        0      9       0      16      9       1        4
2        1      4      16      25     36       0        0
3        1      1       4       0      0       1        4

In [ ]:
nome = "Victor"

In [ ]:
len(nome)

6

In [ ]:
# TRANSFORMOU TODOS OS DADOS DA TABELA EM STRINGS & Contou eles. 
df.applymap(lambda x: len(str(x)))

   Nome  Segunda  Terça  Quarta  Quinta  Sexta  Sabado  Domingo
0     6        1      1       1       1      1       1        1
1     6        1      1       1       1      1       1        1
2     4        1      1       1       1      1       1        1
3     5        1      1       1       1      1       1        1

In [ ]:
# FUNÇÃO P/ AGREGAR LETRA A TODOS OS ELEMENTOS DA TABELA;
df.applymap(lambda x: "X_" + str(x))

       Nome Segunda Terça Quarta Quinta Sexta Sabado Domingo
0  X_Victor     X_2   X_3    X_1    X_3   X_0    X_0     X_3
1  X_Amanda     X_0   X_3    X_0    X_4   X_3    X_1     X_2
2    X_Luis     X_1   X_2    X_4    X_5   X_6    X_0     X_0
3   X_Júlia     X_1   X_1    X_2    X_0   X_0    X_1     X_2